Group Project Proposal

In [11]:
library(tidyverse)

In [21]:
data_salaries <- read_csv("data/ds_salaries.csv") |>
    mutate(employee_residence = as_factor(employee_residence))

Rows: 607 Columns: 12
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr (7): experience_level, employment_type, job_title, salary_currency, empl...
dbl (5): id, work_year, salary, salary_in_usd, remote_ratio

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [22]:
slice(data_salaries, 1:6)

  id work_year experience_level employment_type job_title
1 0  2020      MI               FT              Data Scientist
2 1  2020      SE               FT              Machine Learning Scientist
3 2  2020      SE               FT              Big Data Engineer
4 3  2020      MI               FT              Product Data Analyst
5 4  2020      SE               FT              Machine Learning Engineer
6 5  2020      EN               FT              Data Analyst
  salary salary_currency salary_in_usd employee_residence remote_ratio
1  70000 EUR              79833        DE                   0
2 260000 USD             260000        JP                   0
3  85000 GBP             109024        GB                  50
4  20000 USD              20000        HN                   0
5 150000 USD             150000        US                  50
6  72000 USD              72000        US                 100
  company_location company_size
1 DE               L
2 JP               S
3 GB               M
4 HN               S
5 US               L
6 US               L